src/CF/DocumentJournals/ДокументыПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоставщика</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ДвиженияДенег</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Аналитика</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Статья</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Склад</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Склад</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Договор</Name>
					<References>
						<xr:Item>Document.РасходыТовара.Attribute.Договор</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Договор</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Договор</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Количество</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараВКоличестве</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Поставщик</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.КлиентПоставщик</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтоимостьТовара</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараНаСумму</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сумма</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Сумма</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ВыбылоДенег</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ПоступилоДенег</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сторный</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.Сторный</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Сторный</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Сторный</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/CF/DocumentJournals/ДокументыПоставщика/Forms/ФормаСписка/Ext/Form/Module.bsl
//sza140420-1556  
//sza130909-0324 : 
&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщикуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Поставщики", ДанныеВыбора, Текст, ОтборПоПоставщику);
	ОтборПоПоставщикуПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщикуПриИзменении(Элемент) 	
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоПоставщикуПриИзмененииНаСервере()
	
	список.Параметры.УстановитьЗначениеПараметра("Поставщик", ОтборПоПоставщику);
	список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоОрганизации);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоОрганизации", НЕ ПараметрыСеанса.ВестиУчетСобственныхЮридическихЛицПС ИЛИ НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьПоставщикапоУмолчанию()	
	
	РезультатПолучитьПоставщикапоУмолчанию = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоставщикПоУмолчанию");
	
	Возврат РезультатПолучитьПоставщикапоУмолчанию;
	
КонецФункции //ПолучитьКлиентаПоУмолчанию

&НаКлиенте
Процедура ПриЗакрытии()                                       // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                  // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(параметры.Поставщик) Тогда
		ОтборПоПоставщику = параметры.Поставщик;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборПоПоставщику) Тогда
		ОтборПоПоставщику = ПолучитьПоставщикапоУмолчанию();
	КонецЕсли;
	ОтборПоПоставщикуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("00065А", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , ИСТИНА);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		ОтборПоПоставщикуПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
